<a href="https://colab.research.google.com/github/RudinP/SOLUX_Summer_data_study/blob/master/2%EC%A3%BC%EC%B0%A8/%EC%B1%95%ED%84%B09(0731).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
student_list=[
    {'name':'John',
    'major':'Computer Science',
    'sex':'male'},
    {'name':'Nate',
    'major':'Computer Science',
    'sex':'male'},
    {'name':'Edward',
    'major':'Computer Science',
    'sex':'male'},
    {'name':'Zara',
    'major':'Psychology',
    'sex':'female'},
    {'name':'John',
    'major':'Computer Science',
    'sex':'male'},#끝부분에 ,을 입력해두어도 오류는 안 나는것 같다
]
df=pd.DataFrame(student_list,columns=['name','major','sex'])
df

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4    John  Computer Science    male

In [ ]:
df.duplicated()#4번 열이 중복된 값임을 나타내줌

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [ ]:
df.drop_duplicates()#중복값을 탈락시킴

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female

In [ ]:
student_list=[
    {'name':'John',
    'major':'Computer Science',
    'sex':'male'},
    {'name':'Nate',
    'major':'Computer Science',
    'sex':'male'},
    {'name':'Edward',
    'major':'Computer Science',
    'sex':'male'},
    {'name':'Zara',
    'major':'Psychology',
    'sex':'female'},
    {'name':'Wendy',
    'major':'Economics',
    'sex':'female'},
    {'name':'Nate',
    'major':'None',
    'sex':'male'},
    {'name':'John',
    'major':'Economics',
    'sex':'male'}
]
df=pd.DataFrame(student_list,columns=['name','major','sex'])
df

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female
5    Nate              None    male
6    John         Economics    male

In [ ]:
df.duplicated()#정확하게 일치하는 row, 열이 없다.

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [ ]:
df.duplicated(['name'])#name이 같으면 중복으로 처리하라는 의미

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [ ]:
df.drop_duplicates(['name'], keep='first')#먼저 나온 값을 유지시키고싶고, name이 중복인 기준으로 삭제,keep='last'를 하면 먼저 나온 값이 사라지고 마지막으로 나온 중복값이 유지된다.

     name             major     sex
0    John  Computer Science    male
1    Nate  Computer Science    male
2  Edward  Computer Science    male
3    Zara        Psychology  female
4   Wendy         Economics  female